export const ideaOptions = {
  theme: [
    "Згадка",
    "Мрія",
    "Природа",
    "Місто",
    "Емоція",
  ],

  object: [
    "Дзеркало",
    "Вікно",
    "Дерево",
    "Обличчя",
    "Будівля",
  ],

  mood: [
    "Спокійний",
    "Безрадісний",
    "Меланхолічний",
    "Веселий",
    "Загадковий",
  ],

  palette: [
    "Теплий",
    "Холодний",
    "Монохромний",
    "Пастель",
    "Високий контраст",
  ],

  place: [
    "Ліс",
    "Вулиця",
    "Кімната",
    "Пустота",
    "Океан",
  ],

  details: [
    "Туман",
    "Промені солнця",
    "Пил",
    "Дощ",
    "Текстурний шум",
  ],
};

export const ideaTemplates = [
  "Намалюйте {mood} {theme} із зображенням {object} у {place}. Використайтк {palette} та додайте {details}.",

  "Проілюструйте {object} натхненний {theme}. Сцена відбувається в {place} з атмосферою {mood} та {details}. Використайте {palette} кольори.",

  "Створіть композицію {theme} розташовану в {place}. Зосередьтеся на {object}, створіть відчуття {mood} та додайте {details}. Палітра: {palette}.",
];